coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM369.s
                PUBWEAK INTCANRX_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCANRX_IRQHandler
                B       INTCANRX_IRQHandler

                PUBWEAK INTCANTX_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCANTX_IRQHandler
                B       INTCANTX_IRQHandler

                PUBWEAK INTCANGB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCANGB_IRQHandler
                B       INTCANGB_IRQHandler

                PUBWEAK INTETH_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTETH_IRQHandler
                B       INTETH_IRQHandler

                PUBWEAK INTETHWK_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTETHWK_IRQHandler
                B       INTETHWK_IRQHandler

                PUBWEAK INTADAHP_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADAHP_IRQHandler
                B       INTADAHP_IRQHandler

                PUBWEAK INTADAM0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADAM0_IRQHandler
                B       INTADAM0_IRQHandler

                PUBWEAK INTADAM1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADAM1_IRQHandler
                B       INTADAM1_IRQHandler

                PUBWEAK INTADA_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADA_IRQHandler
                B       INTADA_IRQHandler

                PUBWEAK INTADBHP_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADBHP_IRQHandler
                B       INTADBHP_IRQHandler

                PUBWEAK INTADBM0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADBM0_IRQHandler
                B       INTADBM0_IRQHandler

                PUBWEAK INTADBM1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADBM1_IRQHandler
                B       INTADBM1_IRQHandler

                PUBWEAK INTADB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADB_IRQHandler
                B       INTADB_IRQHandler

                PUBWEAK INTEMG0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTEMG0_IRQHandler
                B       INTEMG0_IRQHandler

                PUBWEAK INTPMD0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPMD0_IRQHandler
                B       INTPMD0_IRQHandler

                PUBWEAK INTENC0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTENC0_IRQHandler
                B       INTENC0_IRQHandler

                PUBWEAK INTEMG1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTEMG1_IRQHandler
                B       INTEMG1_IRQHandler

                PUBWEAK INTPMD1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPMD1_IRQHandler
                B       INTPMD1_IRQHandler

                PUBWEAK INTENC1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTENC1_IRQHandler
                B       INTENC1_IRQHandler

                PUBWEAK INTMTEMG0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTEMG0_IRQHandler
                B       INTMTEMG0_IRQHandler

                PUBWEAK INTMTPTB00_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTPTB00_IRQHandler
                B       INTMTPTB00_IRQHandler

                PUBWEAK INTMTTTB01_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTTTB01_IRQHandler
                B       INTMTTTB01_IRQHandler

                PUBWEAK INTMTCAP00_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP00_IRQHandler
                B       INTMTCAP00_IRQHandler

                PUBWEAK INTMTCAP01_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP01_IRQHandler
                B       INTMTCAP01_IRQHandler

                PUBWEAK INTMTEMG1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTEMG1_IRQHandler
                B       INTMTEMG1_IRQHandler

                PUBWEAK INTMTPTB10_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTPTB10_IRQHandler
                B       INTMTPTB10_IRQHandler

                PUBWEAK INTMTTTB11_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTTTB11_IRQHandler
                B       INTMTTTB11_IRQHandler

                PUBWEAK INTMTCAP10_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP10_IRQHandler
                B       INTMTCAP10_IRQHandler

                PUBWEAK INTMTCAP11_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP11_IRQHandler
                B       INTMTCAP11_IRQHandler

                PUBWEAK INTMTEMG2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTEMG2_IRQHandler
                B       INTMTEMG2_IRQHandler

                PUBWEAK INTMTPTB20_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTPTB20_IRQHandler
                B       INTMTPTB20_IRQHandler

                PUBWEAK INTMTTTB21_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTTTB21_IRQHandler
                B       INTMTTTB21_IRQHandler

                PUBWEAK INTMTCAP20_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP20_IRQHandler
                B       INTMTCAP20_IRQHandler

                PUBWEAK INTMTCAP21_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP21_IRQHandler
                B       INTMTCAP21_IRQHandler

                PUBWEAK INTMTEMG3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTEMG3_IRQHandler
                B       INTMTEMG3_IRQHandler

                PUBWEAK INTMTPTB30_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTPTB30_IRQHandler
                B       INTMTPTB30_IRQHandler

                PUBWEAK INTMTTTB31_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTTTB31_IRQHandler
                B       INTMTTTB31_IRQHandler

                 PUBWEAK INTMTCAP30_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP30_IRQHandler
                B       INTMTCAP30_IRQHandler

                 PUBWEAK INTMTCAP31_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTMTCAP31_IRQHandler
                B       INTMTCAP31_IRQHandler

