coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM369.s
                 PUBWEAK INTRMCRX_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTRMCRX_IRQHandler
                B       INTRMCRX_IRQHandler

                 PUBWEAK INTTB0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB0_IRQHandler
                B       INTTB0_IRQHandler

                 PUBWEAK INTCAP00_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP00_IRQHandler
                B       INTCAP00_IRQHandler

                 PUBWEAK INTCAP01_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP01_IRQHandler
                B       INTCAP01_IRQHandler

                 PUBWEAK INTTB1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB1_IRQHandler
                B       INTTB1_IRQHandler

                 PUBWEAK INTCAP10_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP10_IRQHandler
                B       INTCAP10_IRQHandler

                 PUBWEAK INTCAP11_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP11_IRQHandler
                B       INTCAP11_IRQHandler

                 PUBWEAK INTTB2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB2_IRQHandler
                B       INTTB2_IRQHandler

                 PUBWEAK INTCAP20_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP20_IRQHandler
                B       INTCAP20_IRQHandler

                 PUBWEAK INTCAP21_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP21_IRQHandler
                B       INTCAP21_IRQHandler

                 PUBWEAK INTTB3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB3_IRQHandler
                B       INTTB3_IRQHandler

                 PUBWEAK INTCAP30_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP30_IRQHandler
                B       INTCAP30_IRQHandler

                 PUBWEAK INTCAP31_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP31_IRQHandler
                B       INTCAP31_IRQHandler

                 PUBWEAK INTTB4_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB4_IRQHandler
                B       INTTB4_IRQHandler

                 PUBWEAK INTCAP40_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP40_IRQHandler
                B       INTCAP40_IRQHandler

                 PUBWEAK INTCAP41_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP41_IRQHandler
                B       INTCAP41_IRQHandler

                 PUBWEAK INTTB5_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB5_IRQHandler
                B       INTTB5_IRQHandler

                 PUBWEAK INTCAP50_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP50_IRQHandler
                B       INTCAP50_IRQHandler

                 PUBWEAK INTCAP51_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP51_IRQHandler
                B       INTCAP51_IRQHandler

                 PUBWEAK INTTB6_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB6_IRQHandler
                B       INTTB6_IRQHandler

                 PUBWEAK INTCAP60_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP60_IRQHandler
                B       INTCAP60_IRQHandler

                 PUBWEAK INTCAP61_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP61_IRQHandler
                B       INTCAP61_IRQHandler

                 PUBWEAK INTTB7_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB7_IRQHandler
                B       INTTB7_IRQHandler

                 PUBWEAK INTCAP70_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP70_IRQHandler
                B       INTCAP70_IRQHandler

                 PUBWEAK INTCAP71_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP71_IRQHandler
                B       INTCAP71_IRQHandler

                 PUBWEAK INTRTC_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTRTC_IRQHandler
                B       INTRTC_IRQHandler

                 PUBWEAK INTDMAADA_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAADA_IRQHandler
                B       INTDMAADA_IRQHandler

                 PUBWEAK INTDMAADB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAADB_IRQHandler
                B       INTDMAADB_IRQHandler

                 PUBWEAK INTDMADAA_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMADAA_IRQHandler
                B       INTDMADAA_IRQHandler

                 PUBWEAK INTDMADAB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMADAB_IRQHandler
                B       INTDMADAB_IRQHandler

                 PUBWEAK INTDMASPR0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASPR0_IRQHandler
                B       INTDMASPR0_IRQHandler

                 PUBWEAK INTDMASPT0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASPT0_IRQHandler
                B       INTDMASPT0_IRQHandler

                 PUBWEAK INTDMASPR1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASPR1_IRQHandler
                B       INTDMASPR1_IRQHandler

                 PUBWEAK INTDMASPT1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASPT1_IRQHandler
                B       INTDMASPT1_IRQHandler

                PUBWEAK INTDMASPR2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASPR2_IRQHandler
                B       INTDMASPR2_IRQHandler

                PUBWEAK INTDMASPT2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASPT2_IRQHandler
                B       INTDMASPT2_IRQHandler

                PUBWEAK INTDMAUTR4_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAUTR4_IRQHandler
                B       INTDMAUTR4_IRQHandler

                PUBWEAK INTDMAUTT4_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAUTT4_IRQHandler
                B       INTDMAUTT4_IRQHandler

