coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM369.s
                PUBWEAK INTDMAUTR5_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAUTR5_IRQHandler
                B       INTDMAUTR5_IRQHandler

                PUBWEAK INTDMAUTT5_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAUTT5_IRQHandler
                B       INTDMAUTT5_IRQHandler

                PUBWEAK INTDMARX0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMARX0_IRQHandler
                B       INTDMARX0_IRQHandler

                PUBWEAK INTDMATX0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMATX0_IRQHandler
                B       INTDMATX0_IRQHandler

                PUBWEAK INTDMARX1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMARX1_IRQHandler
                B       INTDMARX1_IRQHandler

                PUBWEAK INTDMATX1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMATX1_IRQHandler
                B       INTDMATX1_IRQHandler

                PUBWEAK INTDMARX2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMARX2_IRQHandler
                B       INTDMARX2_IRQHandler

                PUBWEAK INTDMATX2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMATX2_IRQHandler
                B       INTDMATX2_IRQHandler

                PUBWEAK INTDMARX3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMARX3_IRQHandler
                B       INTDMARX3_IRQHandler

                PUBWEAK INTDMATX3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMATX3_IRQHandler
                B       INTDMATX3_IRQHandler

                PUBWEAK INTDMASBI1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASBI1_IRQHandler
                B       INTDMASBI1_IRQHandler

                PUBWEAK INTDMASBI2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMASBI2_IRQHandler
                B       INTDMASBI2_IRQHandler

                PUBWEAK INTDMATB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMATB_IRQHandler
                B       INTDMATB_IRQHandler

                PUBWEAK INTDMARQ_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMARQ_IRQHandler
                B       INTDMARQ_IRQHandler

                PUBWEAK INTDMAAERR_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAAERR_IRQHandler
                B       INTDMAAERR_IRQHandler

                PUBWEAK INTDMABERR_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMABERR_IRQHandler
                B       INTDMABERR_IRQHandler
              
                END
